/********************************************************************************/
/*																				*/
/*   이 소스 코드의 권리를 명시하는 주석을 제거하지 마시오.							*/
/*   Copyright 2020 by keh														*/
/*																				*/
/*   by keh																		*/
/********************************************************************************/

/********************************************************************
2018.11.11 by KEH
-------------------------------------------------------------
Quick Sort API
*********************************************************************/

#pragma once
#include	<string.h>

struct STSortData {
	unsigned long nValue;
	void *p;
};

void SortEx(STSortData *arr, int nSize);
void getMinMax(STSortData *arr, int nCnt, int*pMin, int*pMax);

